<template>
  <div class="program">
    <div class="program__view">
      <h1>Промежуточное тестирование</h1>
      <div class="program__view--window">
        <div class="">
          <div class="program__view--view">
            <div class="view__score">
              <h1>Вопрос {{ currentQuestion + 1 }}/{{ questions.length }}</h1>
              <h2>Пока нет ответа</h2>
              <h2>Балл: 1,00</h2>
            </div>
            <div class="view__question">
              <h1>{{ questions[currentQuestion] }}</h1>
              <div class="">
                <h2>Ответ:</h2>
                <input type="text" />
              </div>
            </div>
          </div>
        </div>
        <div class="program__view--button">
          <h2
            class="program__view--text1"
            @click="previousQuestion"
            :style="{
              cursor: currentQuestion === 0 ? 'not-allowed' : 'pointer',
              opacity: currentQuestion === 0 ? 0.5 : 1,
            }"
          >
            ПРЕДЫДУЩИЙ ВОПРОС
          </h2>
          <h2 class="program__view--text2" @click="nextQuestion">
            {{
              currentQuestion === questions.length - 1
                ? "ЗАВЕРШИТЬ ТЕСТ"
                : "СЛЕДУЮЩИЙ ВОПРОС"
            }}
          </h2>
        </div>
      </div>
    </div>
  </div>
</template>

<script>
export default {
  name: "ProgramComponent",
  data() {
    return {
      currentQuestion: 0,
      questions: [
        "Вы изучите методы защиты от атак злоумышленников на компьютеры, серверы, мобильные устройства, электронные системы, сети и данные, а также отработаете все навыки на практике.",
        "Вы изучите методы защиты от атак злоумышленников на компьютеры, серверы, мобильные устройства, электронные системы, сети и данные, а также отработаете все навыки на практике.",
        "Вы изучите методы защиты от атак злоумышленников на компьютеры, серверы, мобильные устройства, электронные системы, сети и данные, а также отработаете все навыки на практике.",
        "Вы изучите методы защиты от атак злоумышленников на компьютеры, серверы, мобильные устройства, электронные системы, сети и данные, а также отработаете все навыки на практике.",
        "Вы изучите методы защиты от атак злоумышленников на компьютеры, серверы, мобильные устройства, электронные системы, сети и данные, а также отработаете все навыки на практике.",
        "Вы изучите методы защиты от атак злоумышленников на компьютеры, серверы, мобильные устройства, электронные системы, сети и данные, а также отработаете все навыки на практике.",
        "Вы изучите методы защиты от атак злоумышленников на компьютеры, серверы, мобильные устройства, электронные системы, сети и данные, а также отработаете все навыки на практике.",
        "Вы изучите методы защиты от атак злоумышленников на компьютеры, серверы, мобильные устройства, электронные системы, сети и данные, а также отработаете все навыки на практике.",
        "Вы изучите методы защиты от атак злоумышленников на компьютеры, серверы, мобильные устройства, электронные системы, сети и данные, а также отработаете все навыки на практике.",
        "Вы изучите методы защиты от атак злоумышленников на компьютеры, серверы, мобильные устройства, электронные системы, сети и данные, а также отработаете все навыки на практике.",
        "Вы изучите методы защиты от атак злоумышленников на компьютеры, серверы, мобильные устройства, электронные системы, сети и данные, а также отработаете все навыки на практике.",
        "Вы изучите методы защиты от атак злоумышленников на компьютеры, серверы, мобильные устройства, электронные системы, сети и данные, а также отработаете все навыки на практике.",
        "Вы изучите методы защиты от атак злоумышленников на компьютеры, серверы, мобильные устройства, электронные системы, сети и данные, а также отработаете все навыки на практике.",
        "Вы изучите методы защиты от атак злоумышленников на компьютеры, серверы, мобильные устройства, электронные системы, сети и данные, а также отработаете все навыки на практике.",
        "Вы изучите методы защиты от атак злоумышленников на компьютеры, серверы, мобильные устройства, электронные системы, сети и данные, а также отработаете все навыки на практике.",
        "Вы изучите методы защиты от атак злоумышленников на компьютеры, серверы, мобильные устройства, электронные системы, сети и данные, а также отработаете все навыки на практике.",
        "Вы изучите методы защиты от атак злоумышленников на компьютеры, серверы, мобильные устройства, электронные системы, сети и данные, а также отработаете все навыки на практике.",
        "Вы изучите методы защиты от атак злоумышленников на компьютеры, серверы, мобильные устройства, электронные системы, сети и данные, а также отработаете все навыки на практике.",
        "Вы изучите методы защиты от атак злоумышленников на компьютеры, серверы, мобильные устройства, электронные системы, сети и данные, а также отработаете все навыки на практике.",
        "Вы изучите методы защиты от атак злоумышленников на компьютеры, серверы, мобильные устройства, электронные системы, сети и данные, а также отработаете все навыки на практике.",
        "Вы изучите методы защиты от атак злоумышленников на компьютеры, серверы, мобильные устройства, электронные системы, сети и данные, а также отработаете все навыки на практике.",
        "Вы изучите методы защиты от атак злоумышленников на компьютеры, серверы, мобильные устройства, электронные системы, сети и данные, а также отработаете все навыки на практике.",
        "Вы изучите методы защиты от атак злоумышленников на компьютеры, серверы, мобильные устройства, электронные системы, сети и данные, а также отработаете все навыки на практике.",
        "Вы изучите методы защиты от атак злоумышленников на компьютеры, серверы, мобильные устройства, электронные системы, сети и данные, а также отработаете все навыки на практике.",
      ],
    };
  },
  methods: {
    nextQuestion() {
      if (this.currentQuestion < this.questions.length - 1) {
        this.currentQuestion++;
      } else {
        this.$router.push("/result");
      }
    },

    previousQuestion() {
      if (this.currentQuestion > 0) {
        this.currentQuestion--;
      } else {
        this.$router.push("/messenger");
      }
    },
  },
};
</script>

<style lang="scss" scoped>
.program {
  background-color: #736bff;
  margin: 0;
  border-radius: 50px;
  margin-bottom: 50px;
  &__view {
    border-radius: 50px;

    margin-bottom: 20px;
    > h1 {
      font-size: 36px;
      font-weight: 700;
      margin-top: 0;
      padding-top: 0;
      color: #fff;
      max-width: 1234px;
      margin-left: auto;
      margin-right: auto;
      padding: 3% 5%;
    }

    > h2 {
      font-size: 18px;
      font-weight: 300;
    }
    > div {
      display: flex;
      flex-direction: column;
      align-items: center;
    }
    &--window {
      background-color: #fff;

      display: flex;
      flex-direction: column;
      align-items: center;
      > div {
        width: 100%;
      }
    }
    &--view {
      max-width: 1234px;
      margin-right: auto;
      margin-left: auto;
      width: 100%;
      display: flex;
      flex-direction: row;
      align-items: center;
      justify-content: space-between;
      gap: 20px;
      margin-top: 100px;
    }
    &--button {
      max-width: 1234px;
      margin-right: auto;
      margin-left: auto;
      width: 100%;
      display: flex;
      flex-direction: row;
      align-items: center;
      justify-content: space-between;
      padding: 3% 5%;
    }
    &--text1 {
      padding: 20px 40px;
      background-color: #ffffff;
      border-radius: 9999px;
      font-size: 18px;
      font-weight: 600;
      transition: all 0.1s ease;
      border: 1px solid #93e42b;
      cursor: pointer;

      &:hover {
        transform: scaleX(1.05);
      }

      &:active {
        transform: scaleX(0.95);
      }
    }
    &--text2 {
      padding: 20px 40px;
      background-color: #93e42b;
      border-radius: 9999px;
      font-size: 18px;
      font-weight: 600;
      transition: all 0.1s ease;
      cursor: pointer;

      &:hover {
        transform: scaleX(1.05);
      }

      &:active {
        transform: scaleX(0.95);
      }
    }
  }
}

.view {
  &__score {
    border: 1px solid #93e42b;
    padding: 20px 30px;
    border-radius: 20px;
    > h1 {
      font-size: 24px;
      font-weight: 600;
      color: #000;
    }
    > h2 {
      font-size: 16px;
      font-weight: 600;
      color: #777777;
    }
  }

  &__question {
    width: 70%;
    > h1 {
      font-size: 20px;
      font-weight: 300;
      color: #000;
    }
    > div {
      display: flex;
      flex-direction: row;
      align-items: center;
      justify-content: start;
      gap: 20px;
      > input {
        border: 1px solid #93e42b;
        height: 30px;
        border-radius: 15px;
        width: 100%;
        padding: 10px 20px;
        font-size: 20px;
      }
    }
  }
}
</style>
